/* Errors returned by the device in the form of xml */
"Success" = "Onnistunut";
"TestInProgress" = "Testaus käynnissä... Odota.";
"ErrorDeviceBusy" = "Laite on varattu. Yritä myöhemmin uudelleen.";
"ErrorDuplicateDisplayName" = "Sama näyttönimi tai sijainnin nimi. Anna toinen nimi ja yritä uudelleen.";
"ErrorEmptyEntry" = "Yksi laitteelle lähetetyistä valinnoista on tyhjä. Varmista, että kaikki valinnat ovat kelvollisia ja yritä uudelleen.";
"ErrorListFull" = "Tämän valinnan lisäämiseen ei ole vapaata tilaa. Poista laitteesta valinta ja yritä uudelleen.";
"ErrorSettingNotTested" = "Tätä asetusta ei ole testattu.";
"ErrorSystemFailure" = "Kriittinen virhe tapahtui. Yritä myöhemmin uudelleen.";
"ErrorNoMoreSpace" = "Sähköpostiliitteen enimmäiskoko on liian suuri valitulle palvelimelle. Laske enimmäiskokoa ja yritä uudelleen.";
"ErrorNoWritePermission" = "Valitussa kansiossa ei ole kirjoitusoikeutta. Määritä kansiolle asianmukaiset käyttöoikeudet ja yritä uudelleen.";
"ErrorConnectionFailed" = "Laite ei voi muodostaa yhteyttä määrittämääsi etäpalvelimeen. Tarkista palvelimen asetukset.";
"ErrorConnectionRefused" = "Palvelin hylkäsi yhteyden. Varmista, että palvelimessa on virta ja että se toimii oikein.";
"ErrorServerNotFound" = "Palvelimen isäntänimi ei kelpaa laitteelle. Tarkista palvelimen asetukset.";
"ErrorWrongCredentials" = "Palvelin hylkäsi todennuksessa käytetyt kirjautumistiedot. Anna oikeat kirjautumistiedot ja yritä uudelleen.";
"ErrorConnectionProblem" = "Yhteyden muodostamisessa etäpalvelimeen tapahtui virhe. Tarkista, että palvelin on yhteydessä verkkoon ja toiminnassa.";
"ErrorProtocolNotSupported" = "Etäpalvelin käyttää protokollaa, jota ei tueta.";
"ErrorInvalidFileOrDirectory" = "Määrittämäsi polku on virheellinen. Määritä kelvollinen polku ja yritä uudelleen.";
"ErrorInvalidFolderPath" = "Määrittämäsi polku on virheellinen. Määritä kelvollinen polku ja yritä uudelleen.";
"ErrorInvalidShare" = "Jaettu kansio on virheellinen. Valitse toinen jaettu kansio ja yritä uudelleen.";
"ErrorAuthenticationNeeded" = "Määritetty palvelin vaatii todennuksen. Anna oikeat kirjautumistiedot palvelinyhteyden muodostamiseksi ja yritä uudelleen.";
"ErrorSecureConnectionNotSupported" = "Palvelin ei tue suojattua yhteyttä. Poista valinta Käytä SSL-yhteyttä -valintaruudusta ja yritä uudelleen.";
"ErrorSenderInvalid" = "Lähettäjän sähköpostiosoite on virheellinen. Anna kelvollinen lähettäjän sähköpostiosoite ja yritä uudelleen.";
"ErrorRecipientInvalid" = "Vastaanottajan sähköpostiosoite on virheellinen. Anna kelvollinen vastaanottajan sähköpostiosoite ja yritä uudelleen.";
"ErrorServerError" = "Palvelin palautti virheen. Määritettyä toimintoa ei voitu suorittaa. Tarkista, että olet antanut oikeat palvelimen tiedot.";
"ErrorInvalidServerName" = "Määritetty palvelin on virheellinen. Anna kelvollisen SMTP-palvelimen tiedot ja yritä uudelleen.";

"404 Not Found" = "Laitetta ei havaittu. Varmista, että laite on yhteydessä verkkoon ja sen virta on kytketty.";
"400 Bad Request" = "Pyyntöä ei voida käsitellä, koska siinä on virhe. Yritä myöhemmin uudelleen.";

//error if the seed URL could not be obtained from the device
"COULD_NOT_GET_ACTUAL_URL" = "Laite ei palauttanut kelvollista URL-osoitetta. Odota muutama minuutti ja yritä uudelleen.";

/* XML Data validation errors */
"Setting Error" = "Virhe: puuttuvia tai virheellisiä tietoja";
"MISSING_FOLDER_SETTING" = "Osa kohdekansion tiedoista puuttuu. Valitse kansio, anna käyttäjänimi ja salasana ja yritä sitten uudelleen.";
"MISSING_EMAIL_SETTING" = "Osa sähköpostin kohdetiedoista puuttuu. Anna kaikki sähköpostiasetukset ja yritä uudelleen.";
"MISSING_SERVER_CREDENTIALS" = "Palvelimen kirjautumistiedot puuttuvat. Anna käyttäjänimi ja salasana ja yritä sitten uudelleen.";
"MISSING_DISPLAY_NAME" = "Lähettäjän nimi puuttuu. Anna lähettäjän nimi ja yritä uudelleen.";
"MISSING_EMAIL_ADDRESS" = "Sähköpostiosoite puuttuu. Anna kelvollinen sähköpostiosoite ja yritä uudelleen.";
"MISSING_SERVER" = "Palvelin puuttuu. Anna palvelimen tiedot ja yritä uudelleen.";

"INVALID_PIN" = "Annettu henkilökohtainen tunnusluku on virheellinen. Luvun tulee sisältää tasan neljä numeroa. Anna kelvollinen PIN-koodi ja yritä uudelleen.";
"INVALID_SERVER_PORT" = "Annettu palvelinportin numero on virheellinen. Portin numeron tulee olla välillä 1-65535.";
"INVALID_ATTMT_SIZE" = "Annettu liitteen enimmäiskoko on virheellinen. Luvun tulee olla väliltä 1-9999. Anna luku -1 automaattista liitekokoasetusta varten.";
"INVALID_DFADESTINATION" = "Valittu digitaalisen faksin kohde on virheellinen. Valitse kelvollinen kohde.";
"INVALID_POLLING_TIME" = "Valittu kyselyn aikaväli on virheellinen. Kelvolliset arvot ovat 5, 10, 15, 20, 30, 45 ja 60. Valitse aikaväli ja yritä uudelleen.";
"INVALID_DISPLAY_NAME" = "Annettu lähettäjän nimi on virheellinen. Anna lähettäjän nimi, jossa on alle 25 merkkiä.";

/* Buttons */
"OK" = "OK";
"Cancel" = "Peruuta";
"Hide" = "Piilota";

/* Other errors */
"GENERIC_ERROR_TITLE" = "Virhe";
"GENERIC_DEVICE_ERROR_TITLE" = "Laitevirhe";
"GENERIC_DEVICE_ERROR_DESC" = "Tiedonsiirrossa laitteen kanssa tapahtui tuntematon virhe. Yritä myöhemmin uudelleen.";
"XML_PARSING_ERROR" = "Laite palautti virheelliset tiedot. Odota muutama minuutti ja yritä uudelleen.";
"DEVICE_COMMUNICATION_ERROR_DESC" = "Tiedonsiirrossa laitteen kanssa tapahtui virhe. Tarkista, että laite ja tietokone ovat yhteydessä verkkoon ja yritä uudelleen.";

/*vhm: Added PML Related Errors*/

"DEVICE_NOT_FOUND_TITLE" = "Laitetta ei havaittu";
"DEVICE_NOT_FOUND_DESC" = "Tiedonsiirrossa laitteen kanssa tapahtui virhe. Varmista, että laitteessa on virta ja että se on liitetty oikein. Yritä sitten uudelleen.";

"PML_ERROR_TITLE" = "Laitevirhe";
"PML_ERROR_DESC1" = "Tietojen asetuksessa laitteelle tapahtui virhe. Tarkista, että syöttöarvot ovat kelvolliset.";

"SETTING_REJECTED_TITLE" = "Asetuksia ei hyväksytty";
"SETTING_REJECTED_DESCRIPTION" = "Asennusta ei voitu suorittaa, koska laite suojattu järjestelmänvalvojan salasanalla. Poista järjestelmänvalvojan salasana Sulautettu Web-palvelin avulla. Lisätietoja on laitteen käyttöoppaassa.";

"GENERAL_DATA_MISSING_DESCRIPTION" = "Yhdessä tai usemmassa kentässä ei ole tietoja. Täydennä kaikki kentät tai valitse Peruuta.";


//Device Door open error while printing the fax logs
"DOOR_OPEN_TITLE" = "Luukku tai kansi on auki";
"DOOR_OPEN_DESC" = "Tulostin ei voi tulostaa, koska kansi on auki. Sulje kaikki tulostimen kannet.";


//Device not ready error while printing the fax logs
"INCORRECT_STATE_TITLE" = "Tulostin on virhetilassa";
"INCORRECT_STATE_DESC" = "Ratkaise laitteen virhetila ja yritä uudelleen.";

//Device busy error while printing the fax logs
"DEVICE_BUSY_TITLE" = "Tulostin on varattu";
"DEVICE_BUSY_DESC" = "Odota, kunnes tulostin on suorittanut työn loppuun.";

//Error if the device's region code does not support fax blocking
"CALLER_ID_NOT_SUPPORTED_TITLE" = "Soittajatunnistusta ei tueta";
"CALLER_ID_NOT_SUPPORTED_DESC" = "Laitteelle määritetty maa tai alue ei tue soittajatunnistusta. Valitse laitteen etupaneelista maa tai alue, joka tukee soittajatunnistuspalvelua ja yritä uudelleen.";

//Error if black list entries are applied while device is processing the fax job
"COULD_NOT_APPLY_SETTINGS_TITLE" = "Asetuksia ei voitu ottaa käyttöön.";
"COULD_NOT_APPLY_SETTINGS_DESC" = "Varmista, että laite on online-tilassa eikä käsittele faksaustyötä.";


